{
  "title": "CyberSec ",
  "siteUrl": "https://nervous-ptolemy-18932c.netlify.app",
  "description": "Free security blog informing users of the general threats they face and providing resources to assist them in managing, mitigating and responding to a never ending scope of cyber attack threats.",
  "home": {
    "title": "COVID19 Cyber Threat",
    "description": "> Due to the COVID-19 outbreak an uptick in sophisticated phishing email schemes by cybercriminals has emerged. Malicious actors are posing as the Center for Disease Control and Prevention (CDC) or World Health Organization (WHO) representatives.\n\nThese emails are designed to deceive and trick recipients into taking an action such as clicking a malicious link, or opening an attachment with a virus. Learn what steps you can take to help prevent phishing attacks.\n\nfree security policy templates - PurpleSec Network Security Vulnerabilities\nA network vulnerability is a weakness or flaw which can be exploited by a malicious actor to perform unauthorized actions within a computer system.\n\nMalware Statistics Malware, or malicious software, is any piece of software that was written with the intent of doing harm to data, devices or to people. Types of malware include computer viruses, trojans, spyware, ransomware, adware, worms, file-less malware, or hybrid attacks. Recent malware attacks have bencome more sophisticated with the advent of machine learning and targeted spear phishing emails.\n\nThe total malware infections have been on the rise for the last ten years: 2009 – 12.4 million\n2010 – 29.97 million\n2011 – 48.17 million\n2012 – 82.62 million\n2013 – 165.81 million\n2014 – 308.96 million\n2015 – 452.93 million\n2016 – 580.40 million\n2017 – 702.06 million\n2018 – 812.67 million\n92% of malware is delivered by email.\nMobile malware on the rise with the number of new malware variants for mobile increased by 54% in 2018.\nThird-party app stores host 99.9% of discovered mobile malware.\nMore than 250,000 unique users were attacked by Trojan-Banker.AndroidOS.Asacub malware application.\n98% of mobile malware target Android devices.\nOver the last year, MacOS malware has increased by 165%.\nMalware development rates for Windows decreased by 11.6% since reaching an all-time high in 2015.\nMalware is still the preferred distribution model, used 71.14% of the time over the last 12 months, while PUAs were only used in 28.86% of instances.\nGamut spambot was the most frequently used, with over 86% of all spambot cases involving its use.\nThe United States continues to host the most botnet control servers in the world. Over the last year, 36% of these servers were hosted in America, while 24% were hosted in undefined countries.\nTrojans make up 51.45% of all malware.\n7 out of every 10 malware payloads were ransomware.\n230,000 new malware samples are produced every day — and this is predicted to only keep growing.\nMalware and web-based attacks are the two most costly attack types — companies spent an average of US $2.4 million in defense.\nOverall business detections of malware rose 79% from 2017 due to an increase in backdoors, miners, spyware, and information stealers.\nOver 18 million websites are infected with malware at a given time each week.\n34% of businesses hit with malware took a week or more to regain access to their data.\n90% of financial institutions reported being targeted by malware in 2018.\nRansomware Statistics\nRansomware is a form of malicious software that threatens you with harm, usually by denying you access to your data. Ransomware attacks are often deployed via social engineering tacitics. Once a user falls victim to the attack, their data is encrpyted. The attacker then demands a ransom from the victim, with the promise to restore access to the data upon payment.\n\nRansomware attacks worldwide rose 350% in 2018. Ransomware attacks are estimated to cost $6 trillion annually by 2021.\n50% of a surveyed 582 information security professionals do not believe their organization is prepared to repel a ransomware attack.\n81% of cyber security experts believe there will be more ransomware attacks than ever in 2019.\n75% of companies infected with ransomware were running up-to-date endpoint protection.\nRansomware costs businesses more than $75 billion per year.\nThe NotPeyta ransomware attack losses could exceed $1 billion.\nFedEx lost an estimated $300 million in Q1 2017 from the NotPetya ransomware attack.\nAtlanta, Georgia has spent more than $5 million rebuilding its computer network, after being hit by the SamSam ransomware attack in March 2018.\nThe average cost of a ransomware attack on businesses was $133,000.\nransomware statistics 2019\n\nBusinesses lost around $8,500 per hour due to ransomware-induced downtime. 25% of business executives would be willing to pay between $20,000 and $50,000 to regain access to encrypted data\n30% of organizations who pay the ransom receive all of their money back.\n40% of ransomware victims paid the ransom.\nMore than 50% of ransoms were paid by bitcoin in 2018.\n10% of all ransom demands are over $5,000.\nOf the 1,100 IT professionals surveyed, 90% had clients that suffered ransomware attacks in the past year.\n40% had clients that were subject to at least 6 ransomware attacks.\nA new organization will fall victim to ransomware every 14 seconds in 2019, and every 11 seconds by 2021.\n1.5 million new phishing sites are created every month.\nIn 2019 ransomware from phishing emails increased 109% over 2017.\nREAD MORE STATS\nCryptojacking\nCryptojacking is the unauthorized use of someone else’s computer to mine cryptocurrency. Hackers do this by getting the victim to click on a malicious link in an email that loads crypto mining code on the computer, or by infecting a website with JavaScript code that executes once loaded in the victim’s browser.\n\n25% of businesses are estimated to have been victims of cryptojacking Cryptojacking activity surged to its peak in December 2017, when more than 8 million cryptojacking events were blocked by Symantec.\n25% of the WordPress plugins among Alexa’s most popular sites are flagged with critical vulnerabilities that could allow mining botnets in.\nApplications can take 5 – 10 longer to load when a computer is being used for coin mining.\nSocial Engineering Statistics\nSocial engineering in cyber security is the psychological manipulation of people into performing actions or divulging confidential information. Candidates for a social engineering attack can range from a corporate executive to an elementary school student. Even the most seasoned IT professional can be victimized by this type of attack.\n\n98% of cyber attacks rely on social engineering. Recent data breach statistics found that 63% of successful attacks come from internal sources, either control, errors, or fraud.\n43% of the IT professionals said they had been targeted by social engineering schemes in the last year.\nNew employees are the most susceptible to socially engineered attacks, with 60% of IT professionals citing recent hires as being at high risk.\nsocial engineering statistics 2019\n\n21% of current or former employees use social engineering to gain a financial advantage, for revenge, out of curiosity or for fun. Social engineering attempts spiked more than 500% from the first to second quarter of 2018.\nThe number of breach incidents by type:\nIdentity theft – 65%\nAccount access – 17%\nFinancial access – 13%\nNuisance – 4%\nExistential data – 1%\nThe number of breach incidents by source:\nMalicious outsider – 56%\nAccidental loss – 34%\nMalicious insider – 7%\nHackivist – 2%\nUnknown – 1%\nNumbers of records breached by industry in 2018:\nSocial media: 2.5 billion records, or 56%\nGovernment: 1.2 billion records, or 27%\nOther industries: 380 million records, or 8%\nRetail: 186 million records, or 4%\nTechnology: 171 million records, or 4%\nPhising Statistics\nPhishing is a type of cyber attack where threat actors randomly send emails to a broad audience in an attempt to trick people into providing sensitive information such as account credentials or sensetive information. Targeted emails, or spear phishing, is reported by businesses to be used in 91% of successful data breaches and 95% of all enterpise networks.\n\n56% of IT decision makers say targeted phishing attacks are their top security threat. 83% of global infosec respondents experienced phishing attacks in 2018, an increase from 76% in 2017.\nBusiness email compromise (BEC) scams cost organizations $676 million in 2017.\nCEO fraud is now a $12 billion scam.\n30% of phishing messages get opened by targeted users and 12% of those users click on the malicious attachment or link.\nOnly 3% of targeted users report malicious emails to management.\n53% of IT and security professionals say they have experienced a targeted phishing attack in 2017.\nCredential compromise rose 70% over 2017, and they’ve soared 280% since 2016.\n50% of phishing sites now using HTTPS.\nFake invoices are the #1 disguise for distributing malware.\nBill / invoice 15.9%\nEmail delivery failure 15.3%\nLegal / law enforcement 13.2%\nScanned document 11.5%\nPackage delivery 3.9%\nThe most common malicious attachment types:\nOffice 38%\nArchive 37%\nPDF 14%\nOther Ext 6%\nBinaries 4%\nXML/HTML/JS 1%\nThe volume of email fraud that organizations receive has increased 8% year-over-year.\nBy the end of 2017, the average user was receiving 16 phishing emails per month.\n66% of malware is installed via malicious email attachments.\n49% of non-point-of-sale malware was installed via malicious email.\n21% of ransomware involved social actions, such as phishing.\n30% of phishing messages were opened in 2016 – up from 23% in the 2015 report.\nGovernment\nHalf of all data breaches globally to occur in the United States by 2023.\nOver 70,000 Department of Defense contractors are required to meet CMMC compliance by 2021.\nNearly 60 million Americans have been affected by identity theft.\nU.S. government to spend $15 billion on cyber security related activities in 2019 up 4% over the previous year.\nThe United States is the number one target for targeted cyber attacks.\nUnited States: 38%.\nIndia: 17%.\nJapan: 11%.\nTaiwan: 7%.\nUkraine: 6%.\nSouth Korea: 6%.\nBrunei: 4%.\nRussia: 4%.\nVietnam: 4%.\nPakistan: 3%.\n2019 Malware Statistics\nGeneral Cyber Security Statistics\nThe Cost Of Cyber Security\nIn 2017, cyber crime costs accelerated with organizations spending nearly 23% more than 2016 — on average about $11.7 million.\nBy 2020, we expect IT analysts covering cyber security will be predicting five-year spending forecasts (to 2025) at well over $1 trillion.\nThe United States and the Middle East spend the most on post-data breach response. Costs in the U.S. were $1.56 million and $1.43 million in the Middle East.\nThe average cost of a malware attack on a company is $2.4 million.\nThe average cost in time of a malware attack is 50 days.\n2019 cost of data breach report\n\nGlobal average total cost of a data breach (in millions): 2014 – $3.50\n2015 – $3.79\n2016 – $4.00\n2017 – $3.62\n2018 – $3.86\n2019 – $3.92\nFrom 2016 to 2017 there was a 22.7 % increase in cyber security costs.\nThe average global cost of cyber crime increased by over 27% in 2017.\nThe most expensive component of a cyber attack is information loss, which represents 43% of costs.\nRansomware damage costs exceed $5 billion in 2017, 15 times the cost in 2015.\nThe Equifax breach cost the company over $4 billion in total.\nThe average cost per lost or stolen records per individual is $141 — but that cost varies per country. Breaches are most expensive in the United States ($225) and Canada ($190).\nIn companies with over 50k compromised records, the average cost of a data breach is $6.3 million.\nIncluding turnover of customers, increased customer acquisition activities, reputation losses and diminished goodwill the cost of lost business globally was highest for U.S. companies at $4.13 million per company.\nDamage related to cybercrime is projected to hit $6 trillion annually by 2021.\nCyber Security Risks\nIn 2018 there were 80,000 cyber attacks per day or over 30 million attacks per year.\n21% of all files are not protected in any way.\n41% of companies have over 1,000 sensitive files including credit card numbers and health records left unprotected.\n70% of organizations say that they believe their security risk increased significantly in 2017.\n69% of organizations don’t believe the threats they’re seeing can be blocked by their anti-virus software.\n50% of the security risk that organizations face stems from having multiple security vendors and products.\n7 out of 10 organizations say their security risk increased significantly in 2017.\n65% of companies have over 500 users who never are never prompted to change their passwords.\nRansomware attacks are growing more than 350% annually.\nIoT attacks were up 600% in 2017.\n61 percent of breach victims in 2017 were businesses with under 1,000 employees.\nRansomware damage costs will rise to $11.5 billion in 2019 and a business will fall victim to a ransomware attack every 14 seconds at that time.\n2017 represented an 80% increase in new malware on Mac computers.\nIn 2017 there was a 13% overall increase in reported system vulnerabilities.\n2017 brought a 29% Increase in industrial control system–related vulnerabilities.\nCoin mining represented the biggest growth area in cybercrime in 2017, with antivirus detections up 8,500%\n90% of remote code execution attacks are associated with cryptomining.\nOver 50 Internet of Things commercially available devices shares security vulnerabilities.\n61% of organizations have experienced an IoT security incident.\nThe average cost of a data breach to companies worldwide is $3.86 million.\n77% of compromised attacks in 2017 were fileless.\nIt takes organizations an average of 191 days to identify data breaches.\n69% of companies see compliance mandates driving spending.\n88% companies spent more than $1 million on preparing for the GDPR.\n25% of organizations have a standalone security department.\n54% of companies experienced an industrial control system security incident.\nCyber criminals will steal an estimated 33 billion records in 2023.\nRecent Cyber Security Attacks And Breaches\n2013 – Cyber criminals hacked Yahoo’s 3 billion email accounts gaining access to sensitive customer information.\n2013 – Cyber attackers used malware to steal data from Target company point of sale systems compromising information of approximately one hundred and ten million credit/debit carrying customers.\n2014 – Syrian Electronic Army cyber hacking group infiltrated eBay’s network stealing sensitive information of one hundred and forty-five million users.\n2015 – Hackers broke into Anthem Inc. servers and stole 37.5 million records consisting of sensitive information.\n2015 – Peace a Russian based Cyber-attack group infiltrated LinkedIn stealing email and password combinations of over 117 million customers.\n2016 – Peace cyber-attackers hacked Myspace compromising over 360 million accounts.\n2017 – Uber network was breached compromising data of fifty million riders, seven million drivers and 600,000 US based driver license details.\n2017 – Cyber attackers hacked into Equifax servers and exposed over 143 million consumers’ personal information.\n2018 – Cyber attackers hacked into Marriot international computer systems and compromised five hundred million accounts.\n2018 – Cathy pacific was hacked and 9.4 million accounts compromised.\n2018 – Facebook code was exploited by attackers and 50 million user accounts compromised.\n2018 – Quora was hacked and information belonging to 100million users compromised.\n2019 – Maryland Department of Labor was breached by hackers who illegally accessed names and social security numbers belonging to 78,000 people.\n2019 – Captical One recently had over 106 million records stolen containing personal and financial information.\nIn 2016, Uber reported that hackers stole the information of over 57 million riders and drivers. \nIn 2017, 412 million user accounts were stolen from Friendfinder’s sites.\nIn 2017, 147.9 million consumers were affected by the Equifax Breach.\nAccording to 2017 statistics, there are over 130 large-scale, targeted breaches in the U.S. per year, and that number is growing by 27% per year.\n31% of organizations have experienced cyber attacks on operational technology infrastructure.\n100,000 groups in at least 150 countries and more than 400,000 machines were infected by the Wannacry virus in 2017, at a total cost of around $4 billion.\nIn 2017, 5.4 billion attacks by the WannaCry virus were blocked.\nThere are around 24,000 malicious mobile apps blocked every day.\nIn 2017, the average number of breached records by country was 24,089. The nation with the most breaches annually was India with over 33k files; the US had 28.5k.\nIn 2018, Under Armor reported that its “My Fitness Pal” was hacked, affecting 150 million users.\nBetween January 1, 2005 and April 18, 2018 there have been 8,854 recorded breaches.\nSpending On Cyber Security Will Reach $1 Trillion By 2020.\n\nSmall Business 43% of cyber attacks target small business.\n47% of small businesses had at lease on cyber attack in the past year, 44% of those had two to four attacks.\n70% of small businesses are unprepared to deal with a cyber attack.\n3 out of 4 small businesses say they don’t have sufficient personnel to address IT security.\n66% of small business are very concerned about cyber security risk.\n85% of small businesses plan to increase spending on managed security services.\n51% of small businesses say they are not allocating any budget to cyber security.\n58% of malware attack victims are categorized as small businesses.\nIn 2018, cyber attacks cost small businesses an average of $34,604.\nRansomware damage costs alone are on track to hit $11.5 billion in 2019, at which point it’s estimated that small businesses will fall victim to a ransomware attack every 14 seconds.\n4% of malware sent to small businesses is delivered via email.\nThe most common malicious email disguises are:\n7% bill / invoice\n3% email delivery failure notice\n4% package delivery\n1.1% legal/law enforcement message\n0.3% scanned document\n60% of small businesses say attacks are becoming more severe and more sophisticated.\nOnly 14% of small businesses rate their ability to mitigate cyber risks, vulnerabilities and attacks as highly effective.\n60% of small companies go out of business within six months of a cyber attack.\n48% of data security breaches are caused by acts of malicious intent. Human error or system failure account for the rest.\nSmall businesses are most concerned about the security of customer data:\nConsumer records 66%\nIntellectual property 49%\nCustomer credit or debit card information 46%\nFinancial information 26%\nEmployee records 8%\nBusiness correspondence 5%\nOther 1%\nThe types of cyber attacks on small businesses broke out as following:\nWeb-based attack 49%\nPhishing / social engineering 43%\nGeneral malware 35%\nSQL injection 26%\nCompromised / stole devices 25%\nDenial of services 21%\nAdvance malware / zero day attacks 14%\nMalicious insider 13%\nCross-site scripting 11%\nRansomware 2%\nOther 1%\nThe root causes of data breaches for small businesses broke out as following:\nNegligent employee or contractor 48%\nThird party mistakes 41%\nError in system or operating process\nDon’t know\nExternal (hacker) attacks 27%\nMalicious insider 5%\nOther 2%\nPercentage of small businesses that store valuable data\n68% store email addresses\n64% store phone numbers\n54% store billing addresses\nSmall businesses are not investing in cyber security\n38% regularly upgrade software solutions\n31% monitor business credit reports\n22% encrypt databases\n69% of small businesses do not strictly enforce password policies.\n16% of small businesses say they had only reviewed their cyber security posture after they were hit by an attack.\nOnly 16% of small business are very confident in their cyber security readiness. These areas are lacking:\nStrategy – 52% of small business have a clearly defined strategy around cyber security.\nAccountability – 23% of small businesses have a leadership role dedicated to cyber, whereas 46% have no defined role at all.\nWillingness to respond – 65% of small businesses have failed to act following a cyber security incident.\nTraining – 32% of small businesses have conducted phishing experiments to assess employee behavior and readiness in the event of an attack.\nInsurance – 21% of small businesses have a standalone cyber insurance policy, compared to 58% of large companies.\n4 out of 5 small businesses report malware has evaded their antivirus.\nFinancial Industry\n67% of financial institutions reported an increase in cyber attacks over the past year.\n26% of financial enterprises faced a destructive attack.\n79% of financial CISOs said threat actors are deploying more sophisticated attacks.\n21% suffered a watering-hole attack in the last year.\n32% of financial institutions encountered island hopping, is leveraging one compromised organization to gain entry into another.\n25% of all malware attacks hit banks and other financial industries, more than any other industry\nCredit card compromised increased by 212% year over year, credential leaks experienced a similar increase of 129%, and malicious apps increased by 102%.\n47% of financial institutions reported an increase in wire transfer fraud.\n31% of financial institutions reported an increase in home equity loan fraud.\n79% of financial institutions said cybercriminals have become more sophisticated, leveraging highly targeted social engineering attacks.\n32% of financial institutions reported experiencing counter incident response.\n21% of financial institutions reported experiencing C2 on a sleep cycle.\n70% of financial institutions said they are most concerned about financially motivated attackers.\n30% of financial institutions said they are most concerned with nation-state activity.\nGlobal attack types and sources on financial sectors:\nWeb attacks – 46%\nService-specific attacks – 28%\nDoS/DDoS 8%\n69% of financial institution CISOs are planning to increase cyber security spending by 10% or more in 2019.\n47% of financial institution CISOs said their organizations are operating threat hunt teams.\n32% of financial institution CISOs said they conduct threat hunts on a monthly basis.\n70% of cyber crimes targeting surveyed financial institutions involve lateral movement.\nHealthcare Industry\n16% of healthcare providers report having “fully functional” security programs.\n43% admitted that they are either still developing security programs or have not developed one.\n93% of healthcare organizations are currently using some form of cloud services.\n63% plan to use multiple cloud vendors.\n20% of healthcare domain emails were fraudulent in 2017.\nHealthcare has the highest number of attacks by ransomware over any other industry.\n82% of surveyed healthcare organizations say that security is a top concern.\nHealthcare data breaches are costing the US industries $6.2 billion per year.\nThe average cost of a cyber attack in healthcare is $3.62 million.\n89% of healthcare organization had patient data lost or stolen in the past two years.\nPatient health records can be sold for as much as $363 on the black market which is more than any piece of information from other industries.\n54% of healthcare business associates say their top vulnerability is tied to employee negligence in handling patient information.\n81 percent of healthcare cyber security incidents are rooted in employee negligence.\n69% of healthcare organizations site negligent or careless employees as their top worry for security incidents, followed by cyber attacks (45%) and insecure mobile devices (30%).\nThe healthcare industry was the victim of 88%of all ransomware attacks in US industries in 2016.\n69% of those in the healthcare industry believe they are at great risk for a data breach than other industries.\n94% are now using some form of advanced technology to protect sensitive data.\n25% healthcare organizations using the public cloud report that they are not encrypting patient data.\nREAD MORE STATS\nEducation Industry\nThe education industry is ranked last in cyber security preparedness out of 17 major industries.\n41% of higher education cyber security incidents and breaches were caused by social engineering attacks.\nThere were 455 cyber security incidents in the educational sector last year.\nEducational records can fetch up to $265 on the black market.\n43% have had student data attacked, including dissertation materials and exam results.\n25% have experienced critical intellectual property theft.\n28% have had grant holder research data attacked.\n87% have experienced at least one successful cyber attack.\n83% believe cyber attacks are increasing in frequency and sophistication.\n79% universities have experienced damage to reputation and almost 74% have had to halt a valuable research project as a result of a cyber attack.\n77% also say a cyber breach has the potential to impact national security, due to the potentially sensitive nature of the information which could been compromised.\n64% don’t believe their existing IT infrastructure will protect them against cyber attacks in next 12-18 months.\n27% see the current security of their data center as ‘inadequate’ and in urgent need of updating.\n85% of universities agree that more funding must be given to IT security to protect critical research IP.\nOn average, 30% of users in the education industry have fallen for phishing emails.\nThe education sector accounted for 13% of all data security breaches during the first half of 2017, resulting in the compromise of some 32 million personal records.\nIn March 2018, over 300 universities worldwide suffered from a giant cyber attack organized by nine Iranian hackers. According to the official information, 31 terabytes of “valuable intellectual property and data” was exposed.\nFrequently Asked Questions\n\nNot finding the right answer to your questions? Ask our experts!\n\nWhere are your sources? Where do most cyber attacks come from?\nWhat percentage of malware is distributed by email?\nHow many businesses are targeted by spear-phishing attacks each day?\nWhat percentage of successful cyber attacks were caused by someone falling for a phishing attack?\nCyber Security Resources\nwhat is cyber security?\nwhat is a penetration test?\nwhat is a network vulnerability?\nWhat Is A Social Engineering Attack And How To Prevent Them\nMost Common Types Of Network Vulnerabilities - cyber security resources\nCommon Vulnerabilities\nA network vulnerability is a weakness or flaw in software, hardware, or organizational processes, which may result in a security breach. Learn how you can protect your business.\n\nLEARN MORE Cyber Security Policy Templates - Cyber Security Resources\nCyber Security Templates\nLooking for the latest cyber security policy templates? Check out our library of free templates to secure your network from ransomware, email phishing, and socially engineered attacks.\n\nLEARN MORE 2019 Malware Statistics\nCyber Security Statistics\nCheck out hundreds of the latest cyber security statistics and metrics including the top network vulnerabilities, social engineering, penetration testing, compliance and more.\n\nLEARN MORE steps to performing a successful network vulnerability assessment\nVulnerability Assessments\nA vulnerability assessment is a process of identifying security vulnerabilities in systems, quantifying and analyzing them, and remediating those vulnerabilities based on predefined risks.\n\nLEARN MORE types of penetration tests - cyber security resources\nTypes Of Penetration Tests\nThe types of penetration tests include network services, web application, client side, wireless, social engineering, and physical. A penetration test may be performed externally or internally.\n\nLEARN MORE Protect Your Business From Cyber Attacks - cyber security resources\nProtect Your Business\nIt’s no secret that businesses are lucrative targets for would-be assailants. Many businesses store valuable data and trade secrets that attackers leverage against a company or to sell it on the market.\n\nLEARN MORE Network Vulnerability Scanning And Assessment Services - Purplesec\nProtect Your Business From Cyber Attacks\n\nFill out the form to get a free network vulnerability scan and assessment proposal.\n\n(202) 556-3903 | sales@purplesec.us\n\nName\n\nPhone Number\n\nEmail\n\nCommitment\n\nNumber of Assets (IPs)\n\nTell Us About Your Project\n\nSecurity Resources Penetration Testing Guide\nCyber Security Policy Templates\n2019 Cyber Security Statistics\nVulnerability Assessment Template\nPenetration Testing Template\nWhat Is CMMC?\n\nAgency Services Managed Security Services\nSocial Engineering\nPenetration Testing\nVulnerability Risk Assessments\n\nOur Company Blog\nOur Experts\nTwitter\nPinterest\nYouTube\n202-556-3903\nsales@purplesec.us\n\nPurplesec logo transparent\n\nPurpleSec LLC 2151 Tannin Place\nVienna, Virginia 22182\n\nTerms Of Service | Privacy PolicyCyber criminals will steal an estimated 33 billion records in 2023.Cyber criminals will steal an estimated 33 billion records in 2023.The average cost of a data breach worldwide is $3.86 million.\n\n###### I have been specifically designed to become a digital home for designers and developers, help them build amazing professional looking websites with ease. You don't have to worry about nitty gritty of web hosting services to run a blog and yet take full advantage of CMS to manage content :)"
  }
}